// 出勤キャスト一括管理データ
const castMembers = [
    {
        id: "cast-yuinya",
        name: "ゆいにゃ",
        image: "ゆ.jpeg",
        workDays: ["2026-09-04","2026-09-05","2026-09-08","2026-09-09","2026-09-10","2026-09-12","2026-09-12","2026-09-13","2026-09-14","2026-09-15"]
    },
    {
        id: "cast-fuchan",
        name: "ふちゃん",
        image: "ふちゃん.jpeg",
        workDays: ["2026-09-04","2026-09-08","2026-09-09","2026-09-12","2026-09-13"]
    },
    {
        id: "cast-hime",
        name: "ひめ",
        image: "ひめ.jpeg",
        workDays: ["2026-09-03","2026-09-05","2026-09-10","2026-09-12","2026-09-13"]
    },
    {
        id: "cast-syuka",
        name: "しゅか",
        image: "しゅか.jpeg",
        workDays: ["2026-09-04","2026-09-09","2026-09-15"]
    },
    {
        id: "cast-yuriru",
        name: "ゆりる",
        image: "ゆりる.jpeg",
        workDays: ["2026-09-04","2026-09-08","2026-09-13","2026-09-14"]
    },
    {
        id: "cast-misaki",
        name: "みさき",
        image: "みさき.jpeg",
        workDays: ["2026-09-09", "2026-09-10"]
    },
    {
        id: "cast-kaede",
        name: "楓",
        image: "楓.jpeg",
        workDays: ["2026-09-02","2026-09-05","2026-09-08","2026-09-10","2026-09-12","2026-09-14","2026-09-15"]
    },
    {
        id: "cast-rei",
        name: "れい",
        image: "れい.jpeg",
        workDays: ["2026-09-05","2026-09-14"]
    },
    {
        id: "cast-binetsu",
        name: "微熱",
        image: "微熱.jpeg",
        workDays: ["2026-09-13","2026-09-15"]
    }
];