// 出勤キャスト一括管理データ
const castMembers = [
    {
        id: "cast-yuinya",
        name: "ゆいにゃ",
        image: "ゆいにゃさん.jpg",
        workDays: ["2026-08-01", "2026-08-02","2026-08-03","2026-08-05","2026-08-07","2026-08-08","2026-08-09","2026-08-10","2026-08-11","2026-08-12","2026-08-14","2026-08-15"]
    },
    {
        id: "cast-fuchan",
        name: "ふちゃん",
        image: "ふちゃんさん.jpg",
        workDays: ["2026-08-01", "2026-08-03", "2026-08-07","2026-08-09","2026-08-11","2026-08-12","2026-08-14","2026-08-15"]
    },
    {
        id: "cast-hime",
        name: "ひめ",
        image: "ひめさん.jpg",
        workDays: ["2026-08-02", "2026-08-03","2026-08-05","2026-08-08","2026-08-10","2026-08-12"]
    },
    {
        id: "cast-syuka",
        name: "しゅか",
        image: "しゅかさん.jpg",
        workDays: ["2026-08-07"]
    },
    {
        id: "cast-yuriru",
        name: "ゆりる",
        image: "ゆりるさん.jpg",
        workDays: ["2026-08-01", "2026-08-02", "2026-08-05","2026-08-08","2026-08-09","2026-08-11","2026-08-14"]
    },
    {
        id: "cast-misaki",
        name: "みさき",
        image: "みさきさん.jpg",
        workDays: ["2026-08-10", "2026-08-11"]
    },
    {
        id: "cast-kaede",
        name: "楓",
        image: "楓さん.jpg",
        workDays: ["2026-08-02", "2026-08-05", "2026-08-08","2026-08-09","2026-08-12","2026-08-14","2026-08-15"]
    },
    {
        id: "cast-rei",
        name: "れい",
        image: "れいさん.jpg",
        workDays: ["2026-08-01", "2026-08-03","2026-08-07","2026-08-10","2026-08-15"]
    }
];