// 出勤キャスト一括管理データ
const castMembers = [
    {
        id: "cast-yuinya",
        name: "ゆいにゃ",
        image: "ゆ.jpeg",
        workDays: ["2026-08-01", "2026-08-02","2026-08-03","2026-08-05","2026-08-07","2026-08-08","2026-08-09","2026-08-10","2026-08-11","2026-08-12","2026-08-13","2026-08-14","2026-08-15","2026-09-12"]
    },
    {
        id: "cast-fuchan",
        name: "ふちゃん",
        image: "ふちゃん.jpeg",
        workDays: ["2026-08-01", "2026-08-03", "2026-08-07","2026-08-09","2026-08-11","2026-08-12","2026-08-14","2026-08-15"]
    },
    {
        id: "cast-hime",
        name: "ひめ",
        image: "ひめ.jpeg",
        workDays: ["2026-08-02", "2026-08-03","2026-08-05","2026-08-08","2026-08-10","2026-08-12"]
    },
    {
        id: "cast-syuka",
        name: "しゅか",
        image: "しゅか.jpeg",
        workDays: ["2026-08-07"]
    },
    {
        id: "cast-yuriru",
        name: "ゆりる",
        image: "ゆりる.jpeg",
        workDays: ["2026-08-01", "2026-08-02", "2026-08-05","2026-08-08","2026-08-09","2026-08-11","2026-08-14"]
    },
    {
        id: "cast-misaki",
        name: "みさき",
        image: "みさき.jpeg",
        workDays: ["2026-08-10", "2026-08-11"]
    },
    {
        id: "cast-kaede",
        name: "楓",
        image: "楓.jpeg",
        workDays: ["2026-08-02", "2026-08-05", "2026-08-08","2026-08-09","2026-08-12","2026-08-14","2026-08-15"]
    },
    {
        id: "cast-rei",
        name: "れい",
        image: "れい.jpeg",
        workDays: ["2026-08-01", "2026-08-03","2026-08-07","2026-08-10","2026-08-15"]
    },
    {
        id: "cast-binetsu",
        name: "微熱",
        image: "j.png",
        workDays: ["2026-08-01"]
    }
];